RT-Thread/rt-thread/bsp/freescale/platform/devices/MK24F25612/include/MK24F25612_extension.h
/*******************************************************************************
 * FMC_DATA_MU - Cache Data Storage (mid-upper word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_MU - Cache Data Storage (mid-upper word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-upper word (bits [95:64]) of all 4 sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_MU register
 */
/*@{*/
#define FMC_RD_DATA_MU(base, index, index2) (FMC_DATA_MU_REG(base, index, index2))
#define FMC_WR_DATA_MU(base, index, index2, value) (FMC_DATA_MU_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_MU(base, index, index2, mask, value) (FMC_WR_DATA_MU(base, index, index2, (FMC_RD_DATA_MU(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_MU(base, index, index2, value) (FMC_WR_DATA_MU(base, index, index2, FMC_RD_DATA_MU(base, index, index2) |  (value)))
#define FMC_CLR_DATA_MU(base, index, index2, value) (FMC_WR_DATA_MU(base, index, index2, FMC_RD_DATA_MU(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_MU(base, index, index2, value) (FMC_WR_DATA_MU(base, index, index2, FMC_RD_DATA_MU(base, index, index2) ^  (value)))
/*@}*/

/*******************************************************************************
 * FMC_DATA_ML - Cache Data Storage (mid-lower word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_ML - Cache Data Storage (mid-lower word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * mid-lower word (bits [63:32]) of all 4 sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_ML register
 */
/*@{*/
#define FMC_RD_DATA_ML(base, index, index2) (FMC_DATA_ML_REG(base, index, index2))
#define FMC_WR_DATA_ML(base, index, index2, value) (FMC_DATA_ML_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_ML(base, index, index2, mask, value) (FMC_WR_DATA_ML(base, index, index2, (FMC_RD_DATA_ML(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_ML(base, index, index2, value) (FMC_WR_DATA_ML(base, index, index2, FMC_RD_DATA_ML(base, index, index2) |  (value)))
#define FMC_CLR_DATA_ML(base, index, index2, value) (FMC_WR_DATA_ML(base, index, index2, FMC_RD_DATA_ML(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_ML(base, index, index2, value) (FMC_WR_DATA_ML(base, index, index2, FMC_RD_DATA_ML(base, index, index2) ^  (value)))
/*@}*/

/*******************************************************************************
 * FMC_DATA_LM - Cache Data Storage (lowermost word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_LM - Cache Data Storage (lowermost word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of sixteen 128-bit entries is a 4-way, set-associative cache with 4
 * sets. The ways are numbered 0-3 and the sets are numbered 0-3. In DATAWxSyUM,
 * DATAWxSyMU, DATAWxSyML, and DATAWxSyLM, x denotes the way, y denotes the set,
 * and the final two letters identify the word: UM (uppermost), MU (mid-upper),
 * ML (mid-lower), and LM (lowermost). This section represents data for the
 * lowermost word (bits [31:0]) of all 4 sets (n=0-3) in way 0.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_LM register
 */
/*@{*/
#define FMC_RD_DATA_LM(base, index, index2) (FMC_DATA_LM_REG(base, index, index2))
#define FMC_WR_DATA_LM(base, index, index2, value) (FMC_DATA_LM_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_LM(base, index, index2, mask, value) (FMC_WR_DATA_LM(base, index, index2, (FMC_RD_DATA_LM(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_LM(base, index, index2, value) (FMC_WR_DATA_LM(base, index, index2, FMC_RD_DATA_LM(base, index, index2) |  (value)))
#define FMC_CLR_DATA_LM(base, index, index2, value) (FMC_WR_DATA_LM(base, index, index2, FMC_RD_DATA_LM(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_LM(base, index, index2, value) (FMC_WR_DATA_LM(base, index, index2, FMC_RD_DATA_LM(base, index, index2) ^  (value)))
/*@}*/

/*
 * MK24F25612 FTFA
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - FTFA_FSTAT - Flash Status Register
 * - FTFA_FCNFG - Flash Configuration Register
 * - FTFA_FSEC - Flash Security Register
 * - FTFA_FOPT - Flash Option Register
 * - FTFA_FCCOB3 - Flash Common Command Object Registers
 * - FTFA_FCCOB2 - Flash Common Command Object Registers
 * - FTFA_FCCOB1 - Flash Common Command Object Registers
 * - FTFA_FCCOB0 - Flash Common Command Object Registers
 * - FTFA_FCCOB7 - Flash Common Command Object Registers
 * - FTFA_FCCOB6 - Flash Common Command Object Registers
 * - FTFA_FCCOB5 - Flash Common Command Object Registers
 * - FTFA_FCCOB4 - Flash Common Command Object Registers
 * - FTFA_FCCOBB - Flash Common Command Object Registers
 * - FTFA_FCCOBA - Flash Common Command Object Registers
 * - FTFA_FCCOB9 - Flash Common Command Object Registers
 * - FTFA_FCCOB8 - Flash Common Command Object Registers
 * - FTFA_FPROT3 - Program Flash Protection Registers
 * - FTFA_FPROT2 - Program Flash Protection Registers
 * - FTFA_FPROT1 - Program Flash Protection Registers
 * - FTFA_FPROT0 - Program Flash Protection Registers
 */

